{"pageProps":{"projects":[{"title":"Transcendence","id":"cm0m7sfhzat1108w1s6x2bxit","tags":["Django","Bootstrap","PostgreSQL","Docker"],"source":"https://github.com/EmirKymz/Transcendence","image":{"url":"https://eu-central-1-shared-euc1-02.graphassets.com/cm0lgqq7x05oo07w044d1hss8/cm0m7oxdgalxn08w15b0t7in9"},"description":"Pong Tournament Platformu, kullanıcıların local olarak Pong oyunu oynayabileceği, turnuvalara katılabileceği ve arkadaşlarıyla etkileşimde bulunabileceği kapsamlı bir web uygulamasıdır. Proje, güvenlik, kullanıcı yönetimi, oyun deneyimi ve grafikler açısından birçok önemli özelliği bir araya getirmektedir."},{"title":"Internet Relay Chat Server","id":"cm0m80yxbb4uy08w1dq4y1bgl","tags":["C++","Socket","RFC 1459"],"source":"https://github.com/EmirKymz/IRC","image":{"url":"https://eu-central-1-shared-euc1-02.graphassets.com/cm0lgqq7x05oo07w044d1hss8/cm0m7zyqmbhkq07w58o49ths1"},"description":"Bu proje, kendi IRC (Internet Relay Chat) sunucunuzu oluşturmayı amaçlamaktadır. IRC, internet üzerindeki bilgisayarların birbirleriyle iletişim kurmasını sağlayan köklü ve standart bir protokoldür. Projenin amacı, standart bir IRC istemcisi kullanarak oluşturduğunuz sunucuya bağlanmak ve işlevselliğini test etmektir. Bu proje, ağ programlama, soketler, çoklama (multiplexing), ve RFC 1459 gibi önemli kavramları öğrenmek için mükemmel bir fırsat sunar."},{"title":"To-Do List App","id":"cm0m85z06bsrg07umfwt1g0wi","tags":["ReactNative","JavaScript"],"source":"https://github.com/EmirKymz/TODO_List_ReactNative_Project","image":{"url":"https://eu-central-1-shared-euc1-02.graphassets.com/cm0lgqq7x05oo07w044d1hss8/cm0m855hrbb8l08w1rspvhpnt"},"description":"Bu proje, kullanıcıların günlük görevlerini ve yapılacak işlerini kolayca yönetebilmeleri için geliştirilmiş bir to-do uygulamasıdır. React Native kullanılarak geliştirilen bu uygulama, hem iOS hem de Android platformlarında çalışabilir ve kullanıcılara basit, etkili bir görev yönetimi deneyimi sunar."}]},"__N_SSG":true}